This is the resource definition:


```tf
terraform {
  required_providers {
    stackit = {
      source  = "stackitcloud/stackit"
      version = "0.16.1"
    }
  }
}

resource "stackit_loadbalancer" "loadbalancer" {
  project_id = var.stackit_project_id
  name       = "${var.name}-lb"
  target_pools = [
    for portName, port in var.ports : {
      name        = "target-pool-${portName}"
      target_port = port
      targets = [
        for ip in var.member_ips : {
          display_name = "target-${portName}"
          ip           = ip
        }
      ]
      active_health_check = {
        healthy_threshold   = 10
        interval            = "3s"
        interval_jitter     = "3s"
        timeout             = "3s"
        unhealthy_threshold = 10
      }
    }
  ]
  listeners = [
    for portName, port in var.ports : {
      name        = "listener-${portName}"
      port        = port
      protocol    = "PROTOCOL_TCP"
      target_pool = "target-pool-${portName}"
    }
  ]
  networks = [
    {
      network_id = var.network_id
      role       = "ROLE_LISTENERS_AND_TARGETS"
    }
  ]
  external_address = var.external_address
}
```

And here is a terraform plan with all the fields:


```
  # module.stackit_loadbalancer[0].stackit_loadbalancer.loadbalancer will be created
  + resource "stackit_loadbalancer" "loadbalancer" {
      + external_address = "193.148.172.89"
      + id               = (known after apply)
      + listeners        = [
          + {
              + display_name = (known after apply)
              + port         = 9000
              + protocol     = "PROTOCOL_TCP"
              + target_pool  = "target-pool-bootstrapper"
            },
          + {
              + display_name = (known after apply)
              + port         = 30090
              + protocol     = "PROTOCOL_TCP"
              + target_pool  = "target-pool-join"
            },
          + {
              + display_name = (known after apply)
              + port         = 6443
              + protocol     = "PROTOCOL_TCP"
              + target_pool  = "target-pool-kubernetes"
            },
          + {
              + display_name = (known after apply)
              + port         = 9999
              + protocol     = "PROTOCOL_TCP"
              + target_pool  = "target-pool-recovery"
            },
          + {
              + display_name = (known after apply)
              + port         = 30081
              + protocol     = "PROTOCOL_TCP"
              + target_pool  = "target-pool-verify"
            },
        ]
      + name             = "demo-dbbe43ad-lb"
      + networks         = [
          + {
              + network_id = "a48c2283-1585-4201-ac1d-a34c9e3141e9"
              + role       = "ROLE_LISTENERS_AND_TARGETS"
            },
        ]
      + options          = (known after apply)
      + private_address  = (known after apply)
      + project_id       = "8a694a67-be5a-4d2f-b109-b2128a7c991c"
      + target_pools     = [
          + {
              + active_health_check = {
                  + healthy_threshold   = 10
                  + interval            = "3s"
                  + interval_jitter     = "3s"
                  + timeout             = "3s"
                  + unhealthy_threshold = 10
                }
              + name                = "target-pool-bootstrapper"
              + target_port         = 9000
              + targets             = [
                  + {
                      + display_name = "target-bootstrapper"
                      + ip           = "192.168.178.100"
                    },
                  + {
                      + display_name = "target-bootstrapper"
                      + ip           = "192.168.178.147"
                    },
                  + {
                      + display_name = "target-bootstrapper"
                      + ip           = "192.168.178.173"
                    },
                ]
            },
          + {
              + active_health_check = {
                  + healthy_threshold   = 10
                  + interval            = "3s"
                  + interval_jitter     = "3s"
                  + timeout             = "3s"
                  + unhealthy_threshold = 10
                }
              + name                = "target-pool-join"
              + target_port         = 30090
              + targets             = [
                  + {
                      + display_name = "target-join"
                      + ip           = "192.168.178.100"
                    },
                  + {
                      + display_name = "target-join"
                      + ip           = "192.168.178.147"
                    },
                  + {
                      + display_name = "target-join"
                      + ip           = "192.168.178.173"
                    },
                ]
            },
          + {
              + active_health_check = {
                  + healthy_threshold   = 10
                  + interval            = "3s"
                  + interval_jitter     = "3s"
                  + timeout             = "3s"
                  + unhealthy_threshold = 10
                }
              + name                = "target-pool-kubernetes"
              + target_port         = 6443
              + targets             = [
                  + {
                      + display_name = "target-kubernetes"
                      + ip           = "192.168.178.100"
                    },
                  + {
                      + display_name = "target-kubernetes"
                      + ip           = "192.168.178.147"
                    },
                  + {
                      + display_name = "target-kubernetes"
                      + ip           = "192.168.178.173"
                    },
                ]
            },
          + {
              + active_health_check = {
                  + healthy_threshold   = 10
                  + interval            = "3s"
                  + interval_jitter     = "3s"
                  + timeout             = "3s"
                  + unhealthy_threshold = 10
                }
              + name                = "target-pool-recovery"
              + target_port         = 9999
              + targets             = [
                  + {
                      + display_name = "target-recovery"
                      + ip           = "192.168.178.100"
                    },
                  + {
                      + display_name = "target-recovery"
                      + ip           = "192.168.178.147"
                    },
                  + {
                      + display_name = "target-recovery"
                      + ip           = "192.168.178.173"
                    },
                ]
            },
          + {
              + active_health_check = {
                  + healthy_threshold   = 10
                  + interval            = "3s"
                  + interval_jitter     = "3s"
                  + timeout             = "3s"
                  + unhealthy_threshold = 10
                }
              + name                = "target-pool-verify"
              + target_port         = 30081
              + targets             = [
                  + {
                      + display_name = "target-verify"
                      + ip           = "192.168.178.100"
                    },
                  + {
                      + display_name = "target-verify"
                      + ip           = "192.168.178.147"
                    },
                  + {
                      + display_name = "target-verify"
                      + ip           = "192.168.178.173"
                    },
                ]
            },
        ]
    }
```